import "./about.css"
import bank from "../../../../public/photos/bank.png"
import naft from "../../../../public/photos/naft.png"
import sandogh from "../../../../public/photos/sandogh.png"
import bank2 from "../../../../public/photos/bank2.png"

const About = () => {
    return (
        <div className="about">
            <p>با وجود تمامی مزایای دوچرخه به عنوان وسیله ای عالی، به دلیل ناهمواری شیبها و گسترش شهرها، استفاده از آن نه تنها برای کودکان و سالمندان دشوار کردیده بلکه دوچرخه سواران حرفه ای نیز در استفاده روزمره آنها دچار تردید گردیده اند، راه حل چیست؟ آیا میبایستی چنین وسیله جذابی را از سامانه حمل و نقل سبز شهری حذف نمود؟</p>
            <p>جواب خیر است زیرا در حل این مشکل و معضل و حفظ دوچرخه در کورس حمل‌ونقل شهری، دوچرخه‌هایی الکتریکی یا برقی متولد شدند که در راستای سهولت استفاده از آنها و باقی ماندن و رشد در سامانه حمل و نقل شهری، از چند سال پیش اعلان وجود کرده‌اند</p>
            <p>در دنیای پرترافیک، شلوغ و آلوده شهری امروزه، برای انجام کارهای روزمره‌ و سرعت بخشیدن به آنها، راهی جز استفاده از دوچرخه معمولی یا دوچرخه برقی به عنوان یک وسیله نقلیه دوست داشتنی، سالم، پاک و مفرح پیش رو نمانده است</p>
            <p>از همین رو مجموعه ی دنرو به عنوان یکی از زیر مجموعه های هلدینگ دنکو شکل گرفت، تا با توجه به نیاز جامعه کنونی و با استفاده از پیشرفته ترین امکانات روز دنیا اقدام به تولید انواعی از دوچرخه های سبک و دوچرخه های برقی نموده که علاوه بر تاثیرگذاری بر سلامت فرد و جامعه و همچنین کاهش آلودگی هوا، میتوان آنها را جایگزین بسیار مناسبی نسبت به وسایل نقلیه موتوری بنزینی و دود زا دانست</p>
            <p>دوچرخه های برقی شهری دنرو به گونه ای طراحی شده اند که نه تنها به عنوان یک وسیله ورزشی حرفه ای و نیمه حرفه ای، بلکه به عنوان یک تفریح سالم، مفرح و مفید شناخته شده اند</p>
            <p>ما همواره در دنرو کوشیده ایم تا با بهره گیری از به روز ترین و جدیدترین تکنولوژی های روز دنیا و به کار گیری بهترین متخصصان این مرز و بوم در تولید با کیفیت ترین محصولات حمل و نقل پاک، پیشگام بوده و پرچم دار صنعت حمل و نقل پاک در منطقه باشیم</p>
            <div className="box_bottom_about">
                <h3>سابقه همکاری با </h3>
                <div className="boxImg_bottom_about">
                    <img src={bank} alt="bank" />
                    <img src={naft} alt="naft" />
                    <img src={sandogh} alt="sandogh" />
                    <img src={bank2} alt="bank2" />
                </div>
            </div>
        </div>
    )
}

export default About